#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main(void)
{
	//int n, i = 1, sum = 0;

	//printf("정수를 입력하세요 : ");
	//scanf("%d", &n);

	//while (i <= n)
	//{
	//	sum += i;
	//	i++;
	//}

	//printf("1부터 %d까지의 합은 %d입니다.", n, sum);

	//int i;

	//for (i = 1; i <= 100; i++)
	//{
	//	if (i % 6 == 0)
	//		printf("%d ", i);
	//}

	return 0;
}

// 사용자로부터 1 이상의 정수 n를 받으세요.
// 1부터 n까지의 합을 구해서 출력하는 프로그램 코드를 작성해주세요.
// 5
// 1 + 2 + 3 + 4 + 5

// 1부터 100까지의 정수 중에서 6의 배수만 출력하는 프로그램을 for문을 활용해서 만들어주세요

// 사용자에게 알파벳을 입력받아서 출력하는 프로그램 만들어주세요
// 무한루프방식으로 알파벳을 받으면 출력할 수 있어야함!
// 그런데, 대문자가 입력되면 종료!!

// ch => 변수선언
// scanf() => 입력
// if 조건문 : ch >= 'A' && ch <= 'Z' -> break
// printf()